Revit 2027 API
RebarConstrainedHandle.AllowsConstraintToOtherRebarEdge Method
 Checks if the RebarConstrainedHandle allows constraint of [!:Autodesk::Revit::DB::Structure::RebarConstraintType::ToOtherRebar] type, where target is [!:Autodesk::Revit::DB::Structure::RebarConstraintType::TargetRebarConstraintType::Edge].
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AllowsConstraintToOtherRebarEdge()
Public Function AllowsConstraintToOtherRebarEdge As Boolean
public:
bool AllowsConstraintToOtherRebarEdge()
member AllowsConstraintToOtherRebarEdge : unit -> bool
Return Value
Boolean
 Returns true if the RebarConstrainedHandle allows constraint of [!:Autodesk::Revit::DB::Structure::RebarConstraintType::ToOtherRebar] type, where target is [!:Autodesk::Revit::DB::Structure::RebarConstraintType::TargetRebarConstraintType::Edge].
See Also
Reference
RebarConstrainedHandle Class
Autodesk.Revit.DB.Structure Namespace